# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [12]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 
import pandas as pd
import numpy as np

# Load the pyplot collection of functions from matplotlib, as plt 
from matplotlib import pyplot as plt

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [13]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

url_LondonHousePrices = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  
prop = pd.read_excel(url_LondonHousePrices, sheet_name='Average price', index_col= None)

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [14]:
prop = prop.drop(labels=["Unnamed: 47","YORKS & THE HUMBER", "Unnamed: 37","Unnamed: 34","City of London","England","Inner London","Outer London","NORTH EAST","NORTH WEST","EAST MIDLANDS","WEST MIDLANDS","EAST OF ENGLAND","LONDON","SOUTH EAST","SOUTH WEST"],axis = 1)

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this

In [30]:
prop_t = prop.transpose()
prop_t = prop_t.reset_index()
col1 = prop_t.columns
row_head = prop_t.iloc[0]
prop_t.columns = prop_t.iloc[0]
prop_t = prop_t.drop(labels=0, axis=0)
prop_t = prop_t.rename(columns={"Unnamed: 0":"London Borough" , pd.NaT: 'ID'})
prop_t.head()

,London Borough,ID,1995-01-01 00:00:00,1995-02-01 00:00:00,1995-03-01 00:00:00,1995-04-01 00:00:00,1995-05-01 00:00:00,1995-06-01 00:00:00,1995-07-01 00:00:00,1995-08-01 00:00:00,...,2022-03-01 00:00:00,2022-04-01 00:00:00,2022-05-01 00:00:00,2022-06-01 00:00:00,2022-07-01 00:00:00,2022-08-01 00:00:00,2022-09-01 00:00:00,2022-10-01 00:00:00,2022-11-01 00:00:00,2022-12-01 00:00:00
1,Barking & Dagenham,E09000002,50460.2266,51085.77983,51268.96956,53133.50526,53042.24852,53700.34831,52113.12157,52232.19868,...,337639.17828,333921.39153,337201.79953,345873.99616,349371.12076,350239.35981,349653.85502,355290.62346,359495.10689,362054.07567
2,Barnet,E09000003,93284.51832,93190.16963,92247.52435,90762.87492,90258.00033,90107.23471,91441.24768,92361.31512,...,573655.09452,581811.27928,587188.06846,592754.89104,594041.83267,601931.6599,605424.18481,597777.32861,587967.70766,595486.30411
3,Bexley,E09000004,64958.09036,64787.92069,64367.49344,64277.66881,63997.13588,64252.32335,63722.70055,64432.60005,...,386972.05239,385161.3244,386673.4299,391819.71089,396385.99016,402667.50443,403468.56545,409719.69933,410407.63764,416059.80994
4,Brent,E09000005,71306.56698,72022.26197,72015.76274,72965.63094,73704.04743,74310.48167,74127.03788,73547.0411,...,508372.8301,522338.64309,533942.03626,536486.89116,552316.75952,562407.51963,584927.5386,578010.59307,572262.24808,566794.73925
5,Bromley,E09000006,81671.47692,81657.55944,81449.31143,81124.41227,81542.61561,82382.83435,82898.52264,82054.37156,...,480229.23775,486445.91707,491230.70286,502416.10181,505704.35059,513498.76677,515462.53348,522979.73425,523810.59406,523364.68872

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [32]:
clean_prop = pd.melt(prop_t, id_vars=['London Borough','ID'])
clean_prop = clean_prop.rename(columns = {0: 'Month','value': 'Average Price'})
prop_date = clean_prop.loc[(clean_prop['Month'] >= '2002-12-01')]
prop_date.head(25)



#properties_clean = properties_clean.loc[(properties_clean['London Borough'] >= '2002-12-01')]
#properties_clean = properties_clean.drop(labels=["London Borough"],axis = 0)

            London Borough         ID      Month Average Price
3040    Barking & Dagenham  E09000002 2002-12-01   131709.3326
3041                Barnet  E09000003 2002-12-01    236505.764
3042                Bexley  E09000004 2002-12-01    153739.506
3043                 Brent  E09000005 2002-12-01   207775.1926
3044               Bromley  E09000006 2002-12-01   204090.9091
3045                Camden  E09000007 2002-12-01   328996.2959
3046               Croydon  E09000008 2002-12-01   174796.3015
3047                Ealing  E09000009 2002-12-01   215626.1416
3048               Enfield  E09000010 2002-12-01   180595.2024
3049             Greenwich  E09000011 2002-12-01   158655.0274
3050               Hackney  E09000012 2002-12-01   195298.2814
3051  Hammersmith & Fulham  E09000013 2002-12-01   322552.1997
3052              Haringey  E09000014 2002-12-01   218163.4545
3053                Harrow  E09000015 2002-12-01   223334.3877
3054              Havering  E09000016 2002-12-01    169085.628
3055            Hillingdon  E09000017 2002-12-01   190909.0844
3056              Hounslow  E09000018 2002-12-01   188839.0226
3057             Islington  E09000019 2002-12-01   257882.0772
3058  Kensington & Chelsea  E09000020 2002-12-01   468163.9931
3059  Kingston upon Thames  E09000021 2002-12-01   222346.8239
3060               Lambeth  E09000022 2002-12-01   204576.4686
3061              Lewisham  E09000023 2002-12-01   160358.7313
3062                Merton  E09000024 2002-12-01   213487.8816
3063                Newham  E09000025 2002-12-01   157600.9748
3064             Redbridge  E09000026 2002-12-01   190454.4267

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [17]:
prop_date.isnull().sum()

#properties_clean["Overall Price Change"] = properties_clean['2022-12-01'] - properties_clean['2002-12-01']
#properties_clean['Overall Price Change'] = properties_clean.apply(lambda x: x['2022-12-01'] - x['2002-12-01'], axis=1)

London Borough    0
ID                0
Month             0
Average Price     0
dtype: int64

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

In [18]:
#for col in properties_clean.columns:
    #print(col)
#print(properties_clean)
#print(properties_clean['2002-12-01 00:00:00'])
#properties_clean["Percentage Price Change"] = properties_clean.loc['2022-12-01'] - properties_clean.loc['2002-12-01']
#print(prop_find)

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

In [33]:
prop_date['Year'] = prop_date['Month'].apply(lambda t: t.year)
prop_date.tail(20)

C:\Users\chris\AppData\Local\Temp\ipykernel_58872\1277216754.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  prop_date['Year'] = prop_date['Month'].apply(lambda t: t.year)

             London Borough         ID      Month Average Price  Year
10732              Haringey  E09000014 2022-12-01  600910.36651  2022
10733                Harrow  E09000015 2022-12-01  542277.05953  2022
10734              Havering  E09000016 2022-12-01  442906.34107  2022
10735            Hillingdon  E09000017 2022-12-01  475198.34586  2022
10736              Hounslow  E09000018 2022-12-01  456554.68425  2022
10737             Islington  E09000019 2022-12-01  683287.81858  2022
10738  Kensington & Chelsea  E09000020 2022-12-01  1278176.3339  2022
10739  Kingston upon Thames  E09000021 2022-12-01  570307.20416  2022
10740               Lambeth  E09000022 2022-12-01  553849.59378  2022
10741              Lewisham  E09000023 2022-12-01  470100.13421  2022
10742                Merton  E09000024 2022-12-01  594929.83236  2022
10743                Newham  E09000025 2022-12-01  431657.42753  2022
10744             Redbridge  E09000026 2022-12-01  487456.65597  2022
10745  Richmond upon Thames  E09000027 2022-12-01  742060.80162  2022
10746             Southwark  E09000028 2022-12-01  554637.20676  2022
10747                Sutton  E09000029 2022-12-01   450999.6808  2022
10748         Tower Hamlets  E09000030 2022-12-01  520524.72039  2022
10749        Waltham Forest  E09000031 2022-12-01  510178.70953  2022
10750            Wandsworth  E09000032 2022-12-01  657123.47553  2022
10751           Westminster  E09000033 2022-12-01  910286.63571  2022

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

In [20]:
prop_slice = prop_date.groupby(by=['London Borough', 'Year']).mean()
prop_slice = prop_slice.reset_index()
maxValues = prop_slice.max()
print(maxValues)

London Borough            Westminster
Year                             2022
Month             2022-06-16 12:00:00
Average Price          1428917.607883
dtype: object

C:\Users\chris\AppData\Local\Temp\ipykernel_58872\4279922453.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  prop_slice = prop_date.groupby(by=['London Borough', 'Year']).mean()

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

In [21]:
def create_price_ratio(d):
    y2002 = float(d['Average Price'][d['Year']==2002])
    y2022 = float(d['Average Price'][d['Year']==2022])
    ratio = [y2022/y2002]
    return ratio
create_price_ratio(prop_slice[prop_slice['London Borough']=='Barking & Dagenham'])
final = {}
for bor in prop_slice['London Borough'].unique():
    # Let's make our parameter to our create_price_ratio function: i.e., we subset dfg on 'London_Borough' == b. 
    borough = prop_slice[prop_slice['London Borough'] == bor]
    # Make a new entry in the final dictionary whose value's the result of calling create_price_ratio with the argument: borough
    final[bor] = create_price_ratio(borough)
print(final)

{'Barking & Dagenham': [2.6264181811099694], 'Barnet': [2.489931778399842], 'Bexley': [2.5763756101018047], 'Brent': [2.6247304329575356], 'Bromley': [2.4571777181622636], 'Camden': [2.6031162269715793], 'Croydon': [2.39782294602307], 'Ealing': [2.4507610304713014], 'Enfield': [2.490941198308377], 'Greenwich': [2.703816847664755], 'Hackney': [3.2295473778381476], 'Hammersmith & Fulham': [2.376093382271132], 'Haringey': [2.7366387442043676], 'Harrow': [2.3316635318434065], 'Havering': [2.4960999563093167], 'Hillingdon': [2.396890480520964], 'Hounslow': [2.3508212853927017], 'Islington': [2.767419994077433], 'Kensington & Chelsea': [3.052173231908751], 'Kingston upon Thames': [2.452906678098645], 'Lambeth': [2.67685680718038], 'Lewisham': [2.84267387749656], 'Merton': [2.6785554680636268], 'Newham': [2.611272448074985], 'Redbridge': [2.497776612066709], 'Richmond upon Thames': [2.5989199697528074], 'Southwark': [2.8461344558818986], 'Sutton': [2.43471628893239], 'Tower Hamlets': [2.3165761053862934], 'Waltham Forest': [3.0081823860362045], 'Wandsworth': [2.6499894333341105], 'Westminster': [2.680097158933206]}

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

In [34]:
increase_per = pd.DataFrame(final)
increase_per_T = increase_per.T
increase_per_T = increase_per_T.reset_index()
increase_per_T.rename(columns={'index':"Borough", 0:'2022'}, inplace=True)
increase_per_T.head()
biggest_c = increase_per_T.sort_values(by='2022',ascending = False).head(35)
print(biggest_c)

                 Borough      2022
10               Hackney  3.229547
18  Kensington & Chelsea  3.052173
29        Waltham Forest  3.008182
26             Southwark  2.846134
21              Lewisham  2.842674
17             Islington  2.767420
12              Haringey  2.736639
9              Greenwich  2.703817
31           Westminster  2.680097
22                Merton  2.678555
20               Lambeth  2.676857
30            Wandsworth  2.649989
0     Barking & Dagenham  2.626418
3                  Brent  2.624730
23                Newham  2.611272
5                 Camden  2.603116
25  Richmond upon Thames  2.598920
2                 Bexley  2.576376
24             Redbridge  2.497777
14              Havering  2.496100
8                Enfield  2.490941
1                 Barnet  2.489932
4                Bromley  2.457178
19  Kingston upon Thames  2.452907
7                 Ealing  2.450761
27                Sutton  2.434716
6                Croydon  2.397823
15            Hillingdon  2.396890
11  Hammersmith & Fulham  2.376093
16              Hounslow  2.350821
13                Harrow  2.331664
28         Tower Hamlets  2.316576

### 4. Conclusion
What can you conclude? Type out your conclusion below. 

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!